import type {MultiLingualDictionary} from '@bull-shark/tdh-lib-mason/i18n'
import {Language} from './index'

export const IdCardScannerDictionary: MultiLingualDictionary<typeof Language> = {
  guid: {
    title: {
      th: "ขั้นตอนการสแกนบัตรประชาชน",
      en: "ขั้นตอนการสแกนบัตรประชาชน"
    },
    desc: {
      th: "<h2>ขั้นตอนการสแกนบัตรประชาชน</h2>\n  <ul>\n    <br>\n      <li>  - วางบัตรประชาชนบนพื้นผิวเรียบที่มีสีตัดกับสีของบัตร เช่น พื้นสีขาวหรือดำ</li>\n      <br>\n      <li>  - จัดบัตรประชาชนให้อยู่ในกรอบที่ปรากฏบนหน้าจอโทรศัพท์จนเต็ม โดยให้ขอบของบัตรพอดีกับขอบของกรอบ</li><br>\n      <li>  - ตรวจสอบให้แน่ใจว่าไม่มีเงาตกทับบนบัตร และข้อมูลบนบัตรชัดเจน</li><br>\n      <li>  - หามุมหารถ่ายที่มีแสงสว่างเพียงพอเพื่อให้เห็นข้อมูลบนบัตรได้ชัดเจน</li><br>\n      <li>  - โปรดระมัดระวังนิ้วหรือสิ่งของที่อาจบังข้อมูลบนบัตรประชาชน</li><br>\n      <li>  - แสงสะท้อนจากบัตรอาจทำให้การตรวจสอบข้อมูลยากขึ้น</li><br>\n  </ul>",
      en: "<h2>ขั้นตอนการสแกนบัตรประชาชน</h2>\n  <ul>\n    <br>\n      <li>  - วางบัตรประชาชนบนพื้นผิวเรียบที่มีสีตัดกับสีของบัตร เช่น พื้นสีขาวหรือดำ</li>\n      <br>\n      <li>  - จัดบัตรประชาชนให้อยู่ในกรอบที่ปรากฏบนหน้าจอโทรศัพท์จนเต็ม โดยให้ขอบของบัตรพอดีกับขอบของกรอบ</li><br>\n      <li>  - ตรวจสอบให้แน่ใจว่าไม่มีเงาตกทับบนบัตร และข้อมูลบนบัตรชัดเจน</li><br>\n      <li>  - หามุมหารถ่ายที่มีแสงสว่างเพียงพอเพื่อให้เห็นข้อมูลบนบัตรได้ชัดเจน</li><br>\n      <li>  - โปรดระมัดระวังนิ้วหรือสิ่งของที่อาจบังข้อมูลบนบัตรประชาชน</li><br>\n      <li>  - แสงสะท้อนจากบัตรอาจทำให้การตรวจสอบข้อมูลยากขึ้น</li><br>\n  </ul>"
    },
    footerBtn: {
      th: "ถัดไป",
      en: "Next"
    }
  },
  scan: {
    title: {
      th: "สแกนบัตรประชาชน",
      en: "สแกนบัตรประชาชน"
    },
    preview: {
      title: {
        th: "สแกนบัตรประชาชน",
        en: "สแกนบัตรประชาชน"
      },
      footerPrimaryBtn: {
        th: "ยืนยัน",
        en: "Submit"
      },
      footerSecondaryBtn: {
        th: "ถ่ายใหม่อีกครั้ง",
        en: "ถ่ายใหม่อีกครั้ง"
      }
    }
  },
  form: {
    title: {
      th: "ขั้นตอนการสแกนบัตรประชาชน",
      en: "ขั้นตอนการสแกนบัตรประชาชน"
    },
    inputFieldCitizen: {
      label: {
        th: "เลขบัตรประชาชน",
        en: "เลขบัตรประชาชน"
      }
    },
    inputFieldName: {
      label: {
        th: "ชื่อ",
        en: "ชื่อ"
      }
    },
    inputFieldSurname: {
      label: {
        th: "นามสกุล",
        en: "นามสกุล"
      }
    },
    footerBtn: {
      th: "ถัดไป",
      en: "Next"
    }
  }
}
